# Rename the dataframe columns using rename()

In [1]:
%autosave 60

Autosaving every 60 seconds

In [3]:
import pandas as pd
df = pd.read_csv('customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [4]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace = True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

<div class = "alert alert-block alert-success" >
    <b><i> Success Rename the DataFrame Columns </i> </b>
    </div>